## Plan Result (stg_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_api_management.apim
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "cft-api-mgmt-stg"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "cft-aat-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg"
        name                          = "cft-api-mgmt-stg"
      ~ public_ip_address_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-api-mgmt-aat-private-pip-temp" -> "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-api-mgmt-aat-private-pip"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (21 unchanged attributes hidden)

      ~ virtual_network_configuration {
          ~ subnet_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/temp-migration-subnet" -> "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/api-management"
        }

        # (8 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                                     = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsstg/providers/Microsoft.Authorization/roleAssignments/83cd20de-8bf1-d5e9-38b3-ab5e053ac85b" -> (known after apply)
      ~ name                                   = "83cd20de-8bf1-d5e9-38b3-ab5e053ac85b" -> (known after apply)
      ~ principal_id                           = "3dc6cd48-14a5-43f4-9fbb-53e4fcd426f6" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2139,"Program":"tfcmt","SHA1":"","Target":"stg_apim","Vars":{}} -->